app/controllers/sessions_controller.rb

  def create
    session = params[:session]
    user = User.find_by(email: session[:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "nhuthahuu@gmail.com"], ["LIMIT", 1]]