app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def index
    @users = User.paginate(page: params[:page], per_page:
                          Settings.user.per_page)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def load_user
    @user = User.find_by(id: params[:id])